In [ ]:
import pandas as pd
import numpy as np
import re

# **1st Dataset**

In [ ]:
df = pd.read_csv('/content/data_scientists_salaries_from_reddit.csv')

job_titles = df.iloc[:, 1]

print(job_titles)

#for j in job_titles:
  #print(j)

0                    Data Scientist
1                   Program Analyst
2                    Data Scientist
3      Senior Software Engineer (ML
4           Data Science Consultant
                   ...
550           senior data scientist
551             Lead Data Scientist
552               Epic BI Developer
553               Sr Data Scientist
554                Data Scientist I
Name: title, Length: 555, dtype: object

In [ ]:
new_table = pd.DataFrame()
new_job_titles = []

for jt in job_titles:
  if pd.isna(jt):
    jt = np.nan
  else:
    if 'ds' in jt.lower():
        jt = 'Data Scientist'
    elif 'data' in jt.lower():
        if 'scientist' in jt.lower():
            jt = 'Data Scientist'
        elif 'analy' in jt.lower():
            jt = 'Data Analyst'
    elif 'machine learning' in jt.lower() or 'ml' in jt.lower():
        jt = 'ML Engineer'
    elif 'analytics' in jt.lower():
        jt = 'Analytics Manager'
    elif 'analyst' in jt.lower():
        if 'business' in jt.lower() or 'bi' in jt.lower() or 'intelligence' in jt.lower():
          jt = 'BI Analyst'
        else:
          jt = 'Product Analyst'
    elif 'directo' in jt.lower():
        jt = 'Director'
    elif '/' in jt.lower() and 'sr' in jt.lower():
        temp = jt.split('/')[0]
        jt = temp.split('Sr. ')[1]
    elif '/' in jt.lower():
        jt = jt.split('/')[0]
    elif ',' in jt.lower():
        jt = jt.split(',')[0]
    elif '(' in jt.lower():
        jt = jt.split('(')[0]
    elif 'sr' in jt.lower():
        jt = jt.split('Sr. ')[1]
    elif 'senior' in jt.lower():
        jt = jt.split('Senior ')[1]
    elif '.' in jt.lower():
        jt = jt.split('.')[0]

  new_job_titles.append(jt)

new_table['Job title'] = new_job_titles
print(len(new_table))

555

In [ ]:
for j in new_table['Job title']:
  if j not in ['Data scientist', 'ML engineer', 'Null', 'Analytics manager', 'Business analyst', 'Product analyst', 'Director']:
    print(j)

In [ ]:
print(new_table['Job title'].value_counts())

Job title
Data Scientist           299
Data Analyst              65
ML Engineer               26
Product Analyst           21
Analytics Manager         14
                        ...
Algorithm Developer        1
Marketing Coordinator      1
Researcher                 1
Research Investigator      1
Epic BI Developer          1
Name: count, Length: 81, dtype: int64

In [ ]:
salaries = df.iloc[:, 3]


print(salaries)

0       140,000
1         86000
2        85,000
3          240k
4        65,000
         ...
550    AUD$130k
551        115K
552         NaN
553        150k
554        120k
Name: salary, Length: 555, dtype: object

In [ ]:
new_salaries = []

for salary in salaries:
  if pd.isna(salary):
    salary = np.nan
    new_salaries.append(salary)
  else:
    salary = salary.replace(',', '')
    salary = salary.replace('.', '')
    salary = salary.replace('$', '')
    if '*' in salary:
      salary = salary.split('*')[0].strip()
    if '(' in salary:
      salary = salary.split('(')[0]
    if '/' in salary:
      salary = salary.split('/')[0]
    if '+' in salary:
      parts = salary.split('+')
      sal = 0
      for part in parts:
        if part.isdigit():
          sal += int(part)
      if sal == 0:
        salary = parts[0].strip()
      else:
        salary = str(sal)
    if salary.endswith('k'):
      salary = salary.replace('k', '000', 1)
    elif salary.endswith('K'):
      salary = salary = salary.replace('K', '000', 1)
    elif not salary.endswith('0'):
      for i in range(len(salary)):
        if salary[i].isdigit() and salary[i+1] == 'k' or salary[i].isdigit() and salary[i+1] == 'K':
          salary = salary.replace(salary[i+1], '000', 1)
    if 'base' in salary.lower():
      temp = salary.lower().split('base')
      if temp[0].strip().isdigit():
        salary = temp[0].strip()
      elif temp[1].strip().isdigit():
        salary = temp[1].strip()
    if '¬' in salary:
      salary = salary.split('¬')[0].strip() + ' EUR'
    if salary == '0':
        salary = np.nan
        new_salaries.append(salary)
        continue
    if '800-900' in salary:
      salary =  '10800'
    if '-' in salary:
      if 'cad' in salary:
        salary = '85000 cad'
      elif '150000' in salary:
        salary = '150000'
      else:
        salary = np.nan
        new_salaries.append(salary)
        continue
    if 'per ' in salary:
      if 'month' in salary:
        salary = str(int(salary.split('per')[0].strip()) * 12)
      else:
        salary = salary.split('per')[0].strip()
    if '  ' in salary:
      salary = salary.split('  ')[0].strip()
    if 'lt;' in salary:
      salary = np.nan
      new_salaries.append(salary)
      continue
    if ' pa ' in salary:
      salary = np.nan
      new_salaries.append(salary)
      continue
    if 'started' in salary.lower() or 'renegotiate' in salary.lower() or 'also teach' in salary.lower():
        salary = salary[:6].strip()
    if '14% bonus' in salary.lower():
      salary = '114000'
    if 'usd' in salary.lower():
      temp = salary.lower().split('usd')
      if temp[0].strip().isdigit():
        salary = temp[0].strip() + ' USD'
      elif temp[1].strip().isdigit():
        salary = temp[1].strip() + ' USD'
    elif 'dollars' in salary.lower():
      salary = salary.lower().split('dollars')[0].strip() + ' USD'
    elif 'eur' in salary.lower():
      temp = salary.lower().split('eur')
      if temp[0].strip().isdigit():
        salary = temp[0].strip() + ' EUR'
      elif temp[1].strip().isdigit():
        salary = temp[1].strip() + ' EUR'
    elif 'cad' in salary.lower():
      salary = salary.lower().split('cad')[0].strip().replace(' ','') + ' CAD'
    elif 'dkk' in salary.lower():
      salary = salary.lower().split('dkk')[0].strip() + ' DKK'
    elif 'aud' in salary.lower():
      temp = salary.lower().split('aud')
      if temp[0].strip().isdigit():
        salary = temp[0].strip() + ' AUD'
      elif temp[1].strip().isdigit():
        salary = temp[1].strip() + ' AUD'
    elif 'lpa' in salary.lower() or 'lak' in salary.lower():
      if 'lpa' in salary.lower():
        temp = salary.lower().split('lpa')[0].strip()
        salary = ''.join(c for c in temp if c.isdigit())
      elif 'lak' in salary.lower():
        temp = salary.lower().split('lak')[0].strip()
        salary = ''.join(c for c in temp if c.isdigit())
      salary = str(int(salary) * 100000) + ' INR'
    elif 'chf' in salary.lower():
      salary = salary.lower().split('chf')[1].strip() + ' CHF'
    elif 'TC' in salary:
      salary = salary.split('TC')[1].strip()

    if salary.endswith('0') and not salary.isdigit():
      i = len(salary) - 1
      res = ''
      while salary[i].isdigit():
        res += salary[i]
        i -= 1
      salary = res[::-1]

    salary = salary.strip()
    if salary.isdigit():
      salary += ' USD'

    new_salaries.append(salary)

print(len(new_salaries))

555

In [ ]:
new_salaries_amount = []
new_salaries_currency = []

for salary in new_salaries:
  if pd.isna(salary):
    new_salaries_amount.append(np.nan)
    new_salaries_currency.append(np.nan)
  else:
    new_salaries_amount.append(int(salary.split(' ')[0].strip()))
    new_salaries_currency.append(salary.split(' ')[1].strip())

new_table['Salary amount'] = new_salaries_amount
new_table['Salary currency'] = new_salaries_currency

In [ ]:
conv_ratios = []
for currency in new_salaries_currency:
  if pd.isna(currency):
    cr = np.nan
  else:
    if currency == 'USD':
      cr = 1
    elif currency == 'EUR':
      cr = 1.0882787
    elif currency == 'GBP':
      cr = 1.2951632
    elif currency == 'CAD':
      cr = 0.73006557
    elif currency == 'INR':
      cr = 0.011962834
    elif currency == 'AUD':
      cr = 0.67236147
    elif currency == 'CHF':
      cr = 1.1143726
    elif currency == 'DKK':
      cr = 0.14585547
    elif currency == 'SGD':
      cr = 0.74328847
    elif currency == 'BRL':
      cr = 0.18421977

  conv_ratios.append(cr)

new_table['Conversion ratio'] = conv_ratios

In [ ]:
locations = df.iloc[:, 2]

print(locations.value_counts())

location
New York, NY, USA                            43
United States                                26
San Francisco, CA, USA                       26
Chicago, IL, USA                             21
San Francisco Bay Area, CA, USA              17
                                             ..
4200 Fifth Ave, Pittsburgh, PA 15260, USA     1
South America                                 1
Greater Toronto Area, ON, Canada              1
San Diego, CA, USA                            1
Boise, ID, USA                                1
Name: count, Length: 130, dtype: int64

In [ ]:
new_locations = []
city = ''
state = ''
country = ''
countries = []

i = 0
for location in locations:
  if pd.isna(location):
    city = np.nan
    state = np.nan
    country = np.nan
  else:
    temp = location.split(',')
    if len(temp) == 1:
      city = np.nan
      state = np.nan
      country = temp[0].strip()
    elif len(temp) == 2:
      if 'coast' in temp[0].lower() or 'west' in temp[0].lower() or 'east' in temp[0].lower():
        city = temp[0].strip()
        state = np.nan
        country = temp[1].strip()
      elif 'USA' in temp[1].strip():
        city = np.nan
        state = temp[0].strip()
        country = temp[1].strip()
    elif len(temp) == 3:
      city = temp[0].strip()
      state = temp[1].strip()
      country = temp[2].strip()
    elif len(temp) > 3:
      city = temp[-3:][0].strip()
      state = temp[-2:][0].strip()
      country = temp[-1:][0].strip()

  new_locations.append([city, state, country])
  countries.append(country)

for country in countries:
    if country == 'USA' or country == 'United States':
        countries[countries.index(country)] = 'US'
    elif country == 'Canada':
        countries[countries.index(country)] = 'CA'
    elif country == 'United Kingdom' or country == 'UK':
        countries[countries.index(country)] = 'UK'
    elif country == 'India':
        countries[countries.index(country)] = 'IN'
    elif country == 'Germany':
        countries[countries.index(country)] = 'DE'
    elif country == 'Singapore':
        countries[countries.index(country)] = 'SG'
    elif country == 'Ireland':
        countries[countries.index(country)] = 'IE'
    elif country == 'Austria':
        countries[countries.index(country)] = 'AT'
    elif country == 'Switzerland':
        countries[countries.index(country)] = 'CH'
    elif country == 'Spain':
        countries[countries.index(country)] = 'ES'
    elif country == 'Brazil':
        countries[countries.index(country)] = 'BR'
    elif country == 'Netherlands':
        countries[countries.index(country)] = 'NL'
    elif country == 'Belarus':
        countries[countries.index(country)] = 'BY'
    elif country == 'Lebanon':
        countries[countries.index(country)] = 'LB'
    elif country == 'Argentina':
        countries[countries.index(country)] = 'AR'
    elif country == 'Poland':
        countries[countries.index(country)] = 'PL'
    elif country == 'Israel':
        countries[countries.index(country)] = 'IL'
    elif country == 'Philippines':
        countries[countries.index(country)] = 'PH'
    elif country == 'Czechia':
        countries[countries.index(country)] = 'CZ'
    elif country == 'Hungary':
        countries[countries.index(country)] = 'HU'

new_table['Country'] = countries

print(len(new_locations))

555

In [ ]:
cities = []
states = []

for location in new_locations:
  cities.append(location[0])
  states.append(location[1])

new_table['City'] = cities
new_table['State'] = states

In [ ]:
for location in new_locations:
  print(str(location[0]))
print(len(new_locations))

In [ ]:
years = df.iloc[:, 13]

new_table['Reference year'] = years

new_table['Remote ratio'] = np.nan

In [ ]:
company_industry = df.iloc[:, 4]
print(company_industry.value_counts())

new_company_industry = []

for jt in company_industry:
    if pd.isna(jt):
      jt='Null'
    else:
      if 'consulting' in jt.lower() or 'big 4' in jt.lower() or 'consultancy' in jt.lower() or 'agency' in jt.lower():
          jt ='Consulting'
      elif 'health' in jt.lower() or 'pharma' in jt.lower() or 'medical' in jt.lower() or 'danhar' in jt.lower() or 'clinical' in jt.lower():
          jt ='Healthcare'
      elif 'warehous' in jt.lower() or 'logistics' in jt.lower() or 'supply' in jt.lower():
          jt ='Warehousing and Logistic'
      elif 'travel' in jt.lower() or 'entert' in jt.lower():
          jt ='Travelling and Enterteinment'
      elif 'security' in jt.lower() or 'defense' in jt.lower():
          jt ='Ciber Security'
      elif 'education' in jt.lower() or 'research' in jt.lower() or 'academia' in jt.lower() or 'university' in jt.lower() or 'higher ed' in jt.lower() or 'sensory science' in jt.lower():
          jt ='Education, Research ad University'
      elif 'faang' in jt.lower() or 'public company' in jt.lower() or 'large corporate' in jt.lower() or 'large cable' in jt.lower() or 'maang' in jt.lower() or 'fortune' in jt.lower() or 'large international' in jt.lower() or 'fanng' in jt.lower() or 'fb' in jt.lower() or 'google' in jt.lower() or 'youtube' in jt.lower() or 'amazon' in jt.lower() or 'aaa game' in jt.lower() or 'big n' in jt.lower():
          jt ='Big Tech'
      elif 'small' in jt.lower():
          if 'tech' in jt.lower():
            jt ='Small Tech'
      elif 'tech' in jt.lower() or 'saas' in jt.lower() or 'sas' in jt.lower() or 'game' in jt.lower() or 'gaming' in jt.lower() or 'software' in jt.lower() or 'digital' in jt.lower():
          jt ='Tech Company'
      elif 'finance' in jt.lower() or 'real estate' in jt.lower() or 'm / g' in jt.lower() or 'tmd' in jt.lower() or 'forecast' in jt.lower() or 'pe/vc' in jt.lower() or'statistics' in jt.lower() or 'portofolio' in jt.lower() or 'capital' in jt.lower()  or 'credit' in jt.lower() or 'portfolio' in jt.lower() or 'trading' in jt.lower() or 'crypto' in jt.lower() or 'financial' in jt.lower() or 'bank' in jt.lower() or 'financing' in jt.lower() or 'insurance' in jt.lower():
          jt ='Finance'
      elif 'fintech' in jt.lower():
          jt ='FinTech'
      elif 'startup' in jt.lower() or 'self driving' in jt.lower() or 'self-driving' in jt.lower():
          jt ='StartUp'
      elif 'ecommerce' in jt.lower() or 'e-commerce' in jt.lower():
          jt ='Ecommerce'
      elif 'govern' in jt.lower() or 'federal' in jt.lower():
          jt ='Public Sector and Gonverment'
      elif 'manufactor' in jt.lower() or 'electronics' in jt.lower() or 'automaker'  in jt.lower() or 'steel' in jt.lower() or 'hardware' in jt.lower() or 'manufactur' in jt.lower() or 'components' in jt.lower() or 'semiconductors' in jt.lower() or 'caterpillar' in jt.lower():
          jt ='Manufactoring'
      elif 'energy' in jt.lower() or 'oil' in jt.lower() or 'gas' in jt.lower() or 'utilit' in jt.lower():
          jt ='Energy, oil and gas'
      elif 'marketing' in jt.lower() or 'advertising' in jt.lower() or 'media' in jt.lower():
          jt ='Marketing, Media and Advertising'
      elif 'retail' in jt.lower() or 'fmcg' in jt.lower() or 'consumer' in jt.lower() or 'goods' in jt.lower() or 'cpg' in jt.lower() or 'food' in jt.lower() or 'brewery' in jt.lower():
          jt ='Retail'
      else:
          jt ='Others'
    new_company_industry.append(jt)

new_table['Company industry'] = new_company_industry
new_table['Company size'] = np.nan

company_industry
Tech                      22
Finance                   14
Healthcare                13
Fintech                    8
Consulting                 7
                          ..
The Home Depot/Retail      1
Utility                    1
Tech startup               1
fintech                    1
Large Non-Tech Company     1
Name: count, Length: 329, dtype: int64

In [ ]:
education = df.iloc[:, 5]
print(education.value_counts())

new_education_table = pd.DataFrame(columns=['Education'])
new_education = []

for jt in education:
    if pd.isna(jt):
      jt=np.nan
    else:
      jt = jt.lower()
      if 'phd' in jt or 'ph.d.' in jt or 'doctoral' in jt or 'ph.d' in jt:
          jt='PhD'
      elif 'mba' in jt or 'analytics' in jt:
          jt='MBA'
      elif 'msc' in jt or 'master' in jt or 'ms' in jt or 'm.sc.' in jt or 'm.s.' in jt or 'm.sc' in jt or 'm. sc.' in jt or 'm.' in jt or 'ma' in jt or 'msba' in jt or 'mis' in jt:
          if 'engineering' in jt or 'software' in jt or 'physics' in jt or 'statistics' in jt or 'mathematics' in jt or 'data science' in jt  or 'comp' in jt or 'stat' in jt or 'math' in jt or 'stem' in jt or 'technical' in jt or 'bio' in jt or 'artificial' in jt or 'ds' in jt or 'big data' in jt or 'cs' in jt or 'hard science' in jt or 'me' in jt or 'mis' in jt:
            jt='MSc in STEM'
          elif 'economics' in jt or 'business' in jt or 'finance' in jt or 'accounting' in jt or 'econ' in jt or 'msba' in jt:
            jt='MSc in economics'
          elif 'psychology' in jt or 'sociology' in jt or 'm.ed' in jt or 'communication' in jt or 'political science' in jt or 'ed' in jt or 'poli sci' in jt:
            jt='MSc in human sciences'
          elif 'fisheries' in jt or 'french' in jt or 'spatial analysis' in jt or 'natural resources' in jt or 'global studies' in jt or 'criminal justice' in jt or 'physical sciences' in jt:
            jt='MSc in Others'
          else:
            jt='MSc not specified'
      elif 'bachelor' in jt or 'bs' in jt or 'ba' in jt or 'b.s.' in jt or 'b.s' in jt or 'post graduate' in jt:
          if 'engineering' in jt or 'software' in jt or 'physics' in jt or 'statistics' in jt or 'mathematics' in jt or 'data science' in jt  or 'comp' in jt or 'stat' in jt or 'math' in jt or 'stem' in jt or 'technical' in jt or 'bio' in jt or 'artificial' in jt or 'ds' in jt or 'big data' in jt or 'cs' in jt or 'hard science' in jt or 'me' in jt:
            jt='BSc in STEM'
          elif 'economics' in jt or 'business' in jt or 'finance' in jt or 'accounting' in jt or 'econ' in jt:
            jt='BSc in economics'
          elif 'psychology' in jt or 'sociology' in jt or 'm.ed' in jt or 'communication' in jt or 'political science' in jt or 'ed' in jt or 'poli sci' in jt:
            jt='BSc in human sciences'
          elif 'fisheries' in jt or 'french' in jt or 'spatial analysis' in jt or 'natural resources' in jt or 'global studies' in jt or 'criminal justice' in jt or 'physical sciences' in jt:
            jt='BSc in Others'
          else:
            jt='BSc not specified'
      elif 'no college' in jt or 'ged' in jt or 'hs' in jt or 'high school' in jt or 'undergrad' in jt or 'no degree' in jt or 'dropout' in jt or 'self taught' in jt or 'none' in jt:
          jt='No degree'
      elif 'engineering' in jt or 'stem' in jt or 'stats' in jt:
        jt='MSc in STEM'
      elif 'quantitative psychology' in jt:
        jt='MSc in human sciences'
      else:
          jt='No degree'
    new_education.append(jt)

new_table['Education'] = new_education

education
PhD                                                28
Masters                                            14
MS                                                 11
Bachelors                                           5
MS Statistics                                       4
                                                   ..
BS Mathematics, minors Data Science and Physics     1
Physics PhD + 4.5 years postdoc                     1
PhD in Geophysics                                   1
PhD, Engineering                                    1
BS Accounting MS Tech                               1
Name: count, Length: 394, dtype: int64

In [ ]:
prior_experience = df.iloc[:, 6]
new_priorExperience_table = pd.DataFrame(columns=['Prior Experience'])
new_priorExperience = []

pattern = r'(\d+(\.\d+)?)\s*year'
pattern1 = r'(\d+(\.\d+)?)\s*yrs'
pattern2 = r'(\d+(\.\d+)?)\s*Year'
pattern3 = r'(\d+(\.\d+)?)\s*YOE'
pattern4 = r'(\d+(\.\d+)?)\s*yoe'

for jt in prior_experience:
    if pd.isna(jt):
      jt=np.nan
    else:
      matches = re.findall(pattern, jt)
      matches1 = re.findall(pattern1, jt)
      matches2 = re.findall(pattern2, jt)
      matches3 = re.findall(pattern3, jt)
      matches4 = re.findall(pattern4, jt)

      total_experience = sum(float(match[0]) for match in matches)
      total_experience += sum(float(match[0]) for match in matches1)
      total_experience += sum(float(match[0]) for match in matches2)
      total_experience += sum(float(match[0]) for match in matches3)
      total_experience += sum(float(match[0]) for match in matches4)

      if(total_experience==0):
        if 'internship' in jt.lower():
          jt = 'IS'
        elif '1y' in jt.lower():
          jt = 'EN'
        else:
          jt = np.nan
      else:
        if (total_experience < 3):
          jt = 'EN'
        elif (total_experience >= 3 and total_experience < 5):
          jt = 'MI'
        elif (total_experience >= 5):
          jt = 'SE'

    new_priorExperience.append(jt)

new_table['Experience level'] = new_priorExperience
new_table['Employment type'] = np.nan

In [ ]:
nulls = 0
for country in countries:
  if pd.isna(country):
    nulls += 1

print(nulls)

nulls = 0
for expL in prior_experience:
  if pd.isna(expL):
    nulls += 1

print(nulls)

129
218

In [ ]:
count = 0
for index, row in new_table.iterrows():
  if pd.isna(row['Country']) and pd.isna(row['Experience level']):
    count += 1

print(count)

69

In [ ]:
count = 0
for index, row in new_table.iterrows():
  if pd.isna(row['Salary amount']):
    count += 1

print(count)

98

In [ ]:
count = 0
for index, row in new_table.iterrows():
  if pd.isna(row['Salary amount']) and pd.isna(row['Salary currency']) and pd.isna(row['Conversion ratio']):
    count += 1

print(count)

98

In [ ]:
new_table = new_table.dropna(subset=['Salary amount'])
new_table = new_table.dropna(subset=['Country'])
print(new_table)

                                             Job title  Salary amount  \
0                                       Data Scientist       140000.0
5                                    Analytics Manager       120000.0
7                                       Data Scientist       135000.0
8                                       Data Scientist        74000.0
9                                       Data Scientist        93000.0
..                                                 ...            ...
547                                     Data Scientist       115000.0
548                                     Data Scientist       160000.0
549  Manager, Risk Strategy &amp; Policy (Data Science       110000.0
551                                     Data Scientist       115000.0
553                                     Data Scientist       150000.0

    Salary currency  Conversion ratio Country  Reference year  Remote ratio  \
0               USD               1.0      US            2020           NaN
5               USD               1.0      CA            2020           NaN
7               USD               1.0      US            2020           NaN
8               USD               1.0      US            2020           NaN
9               USD               1.0      US            2020           NaN
..              ...               ...     ...             ...           ...
547             USD               1.0      US            2023           NaN
548             USD               1.0      US            2023           NaN
549             USD               1.0      US            2023           NaN
551             USD               1.0      US            2023           NaN
553             USD               1.0      US            2023           NaN

                      Company industry  Company size              Education  \
0                  Energy, oil and gas           NaN            MSc in STEM
5                             Big Tech           NaN            BSc in STEM
7                         Tech Company           NaN                    PhD
8                         Tech Company           NaN      MSc not specified
9    Education, Research ad University           NaN            MSc in STEM
..                                 ...           ...                    ...
547                     Ciber Security           NaN          BSc in Others
548                         Healthcare           NaN  BSc in human sciences
549                       Tech Company           NaN            BSc in STEM
551                       Tech Company           NaN            MSc in STEM
553                            Finance           NaN                    PhD

    Experience level  Employment type
0                 EN              NaN
5                 SE              NaN
7                 IS              NaN
8                 SE              NaN
9                 EN              NaN
..               ...              ...
547              NaN              NaN
548              NaN              NaN
549              NaN              NaN
551              NaN              NaN
553               EN              NaN

[363 rows x 12 columns]

In [ ]:
count = 0
for index, row in new_table.iterrows():
  if pd.isna(row['Experience level']):
    count += 1

print(count)

145

# **2nd Dataset**

In [ ]:
df2 = pd.read_csv('/content/salaries (2).csv')
job_titles = df2['job_title']
print(job_titles.value_counts())

job_title
Data Engineer                    3464
Data Scientist                   3314
Data Analyst                     2440
Machine Learning Engineer        1705
Research Scientist                531
                                 ...
Quantitative Research Analyst       1
AWS Data Architect                  1
Analytics Engineering Manager       1
Marketing Data Scientist            1
Applied Research Scientist          1
Name: count, Length: 155, dtype: int64

In [ ]:
new_table2 = pd.DataFrame()

new_job_titles = []

for jt in job_titles:
  if pd.isna(jt):
    jt = 'Null'
    print(jt)
  else:
    if 'data' in jt.lower():
        if 'scientist' in jt.lower():
            jt = 'Data Scientist'
        elif 'analy' in jt.lower():
            jt = 'Data Analyst'
        elif 'manager' in jt.lower():
            jt = 'Data Manager'
        elif 'engineer' in jt.lower() or 'architect':
            jt = 'Data Engineer'
        elif 'science' in jt.lower():
            jt = 'Data Scientist'
    elif 'machine learning' in jt.lower() or 'ml' in jt.lower():
        jt = 'ML Engineer'
    elif 'research' in jt.lower():
        jt = 'Research Engineer'
    elif 'ai' in jt.lower():
        jt = 'AI Engineer'
    elif 'business' in jt.lower() or 'bi ' in jt.lower():
      if 'engineer' in jt.lower():
        jt = 'BI Engineer'
      elif 'analyst' in jt.lower():
        jt = 'BI Analyst'
      elif 'manager' in jt.lower():
        jt = 'BI Manager'
      elif 'developer' in jt.lower():
        jt = 'BI Developer'
      else:
        jt = 'BI Analyst'

  new_job_titles.append(jt)

new_table2['Job title'] = new_job_titles
new_table2['Reference year'] = df2['work_year']

In [ ]:
t = []
for jt in new_job_titles:
    if jt not in t:
      t.append(jt)
for te in t:
  print(te)

In [ ]:
salaries = df2['salary']

for s in salaries:
  if pd.isna(s):
    print(s)
  elif not str(s).isdigit:
    print(s)

new_table2['Salary amount'] = salaries

In [ ]:
salary_currencies = df2['salary_currency']

new_table2['Salary currency'] = salary_currencies

conv_ratios = []
for currency in salary_currencies:
  if currency == 'Null':
    cr = 'Null'
  else:
    if currency == 'USD':
      cr = 1
    elif currency == 'EUR':
      cr = 1.0882787
    elif currency == 'GBP':
      cr = 1.2951632
    elif currency == 'CAD':
      cr = 0.73006557
    elif currency == 'INR':
      cr = 0.011962834
    elif currency == 'AUD':
      cr = 0.67236147
    elif currency == 'CHF':
      cr = 1.1143726
    elif currency == 'DKK':
      cr = 0.14585547
    elif currency == 'SGD':
      cr = 0.74328847
    elif currency == 'BRL':
      cr = 0.18421977
    elif currency == 'PLN':
      cr = 0.25486645
    elif currency == 'JPY':
      cr = 0.0063014631
    elif currency == 'TRY':
      cr = 0.030213532
    elif currency == 'HUF':
      cr = 0.0027768293
    elif currency == 'ILS':
      cr = 0.27555599
    elif currency == 'NOK':
      cr = 0.09228212
    elif currency == 'THB':
      cr = 0.02764467
    elif currency == 'NZD':
      cr = 0.60512592
    elif currency == 'PHP':
      cr = 0.017113229
    elif currency == 'ZAR':
      cr = 0.05514742
    elif currency == 'HKD':
      cr = 0.1281279
    elif currency == 'MXN':
      cr = 0.056389299
    elif currency == 'CLP':
      cr = 0.0010997046

  conv_ratios.append(cr)

new_table2['Conversion ratio'] = conv_ratios

print(new_table2)

            Job title  Reference year Country  City  State  Company industry  \
0         AI Engineer            2024      US   NaN    NaN               NaN
1         AI Engineer            2024      US   NaN    NaN               NaN
2       Data Engineer            2024      US   NaN    NaN               NaN
3       Data Engineer            2024      US   NaN    NaN               NaN
4         ML Engineer            2024      US   NaN    NaN               NaN
...               ...             ...     ...   ...    ...               ...
16529  Data Scientist            2020      US   NaN    NaN               NaN
16530  Data Scientist            2021      US   NaN    NaN               NaN
16531  Data Scientist            2020      US   NaN    NaN               NaN
16532    Data Analyst            2020      US   NaN    NaN               NaN
16533    Data Manager            2021      IN   NaN    NaN               NaN

      Company size  Education Experience level Employment type  \
0                M        NaN               SE              FT
1                M        NaN               SE              FT
2                M        NaN               SE              FT
3                M        NaN               SE              FT
4                M        NaN               SE              FT
...            ...        ...              ...             ...
16529            L        NaN               SE              FT
16530            L        NaN               MI              FT
16531            S        NaN               EN              FT
16532            L        NaN               EN              CT
16533            L        NaN               SE              FT

      Salary currency  Conversion ratio
0                 USD          1.000000
1                 USD          1.000000
2                 USD          1.000000
3                 USD          1.000000
4                 USD          1.000000
...               ...               ...
16529             USD          1.000000
16530             USD          1.000000
16531             USD          1.000000
16532             USD          1.000000
16533             INR          0.011963

[16534 rows x 12 columns]

In [ ]:
remote_ratios = df2['remote_ratio']

for r in remote_ratios:
  if pd.isna(r):
    print(r)

new_table2['Remote ratio'] = remote_ratios

In [ ]:
locations = df2['company_location']

for l in locations:
  if pd.isna(l):
    print(l)
  elif len(l) != 2:
    print(l)

print(locations.value_counts())

new_table2['Country'] = locations

company_location
US    14518
GB      694
CA      455
ES      133
DE      105
      ...
AM        1
QA        1
AD        1
EC        1
MD        1
Name: count, Length: 77, dtype: int64

In [ ]:
new_table2['City'] = np.nan
new_table2['State'] = np.nan

In [ ]:
new_table2['Company industry'] = np.nan
new_table2['Company size'] = df2['company_size']
new_table2['Education'] = np.nan
new_table2['Experience level'] = df2['experience_level']
new_table2['Employment type'] = df2['employment_type']

In [ ]:
print(new_table2)

            Job title  Reference year Country  City  State  Company industry  \
0         AI Engineer            2024      US   NaN    NaN               NaN
1         AI Engineer            2024      US   NaN    NaN               NaN
2       Data Engineer            2024      US   NaN    NaN               NaN
3       Data Engineer            2024      US   NaN    NaN               NaN
4         ML Engineer            2024      US   NaN    NaN               NaN
...               ...             ...     ...   ...    ...               ...
16529  Data Scientist            2020      US   NaN    NaN               NaN
16530  Data Scientist            2021      US   NaN    NaN               NaN
16531  Data Scientist            2020      US   NaN    NaN               NaN
16532    Data Analyst            2020      US   NaN    NaN               NaN
16533    Data Manager            2021      IN   NaN    NaN               NaN

      Company size  Education Experience level Employment type  \
0                M        NaN               SE              FT
1                M        NaN               SE              FT
2                M        NaN               SE              FT
3                M        NaN               SE              FT
4                M        NaN               SE              FT
...            ...        ...              ...             ...
16529            L        NaN               SE              FT
16530            L        NaN               MI              FT
16531            S        NaN               EN              FT
16532            L        NaN               EN              CT
16533            L        NaN               SE              FT

      Salary currency  Conversion ratio  Salary amount  Remote ratio
0                 USD          1.000000         202730             0
1                 USD          1.000000          92118             0
2                 USD          1.000000         130500             0
3                 USD          1.000000          96000             0
4                 USD          1.000000         190000             0
...               ...               ...            ...           ...
16529             USD          1.000000         412000           100
16530             USD          1.000000         151000           100
16531             USD          1.000000         105000           100
16532             USD          1.000000         100000           100
16533             INR          0.011963        7000000            50

[16534 rows x 14 columns]

#**Final table**

In [ ]:
final_table = pd.concat([new_table, new_table2], ignore_index=True)
print(final_table)

                     Job title  Salary amount Salary currency  \
0               Data Scientist       140000.0             USD
1              Product Analyst        86000.0             USD
2               Data Scientist        85000.0             USD
3                  ML Engineer       240000.0             USD
4      Data Science Consultant        65000.0             USD
...                        ...            ...             ...
16986           Data Scientist       412000.0             USD
16987           Data Scientist       151000.0             USD
16988           Data Scientist       105000.0             USD
16989             Data Analyst       100000.0             USD
16990             Data Manager      7000000.0             INR

       Conversion ratio Country     City State  Reference year  Remote ratio  \
0              1.000000      US  Houston    TX            2020           NaN
1              1.000000     NaN      NaN   NaN            2020           NaN
2              1.000000     NaN      NaN   NaN            2020           NaN
3              1.000000     NaN      NaN   NaN            2020           NaN
4              1.000000     NaN      NaN   NaN            2020           NaN
...                 ...     ...      ...   ...             ...           ...
16986          1.000000      US      NaN   NaN            2020         100.0
16987          1.000000      US      NaN   NaN            2021         100.0
16988          1.000000      US      NaN   NaN            2020         100.0
16989          1.000000      US      NaN   NaN            2020         100.0
16990          0.011963      IN      NaN   NaN            2021          50.0

          Company industry Company size              Education  \
0      Energy, oil and gas          NaN            MSc in STEM
1           Ciber Security          NaN  MSc in human sciences
2           Ciber Security          NaN            MSc in STEM
3             Tech Company          NaN            BSc in STEM
4             Tech Company          NaN                    PhD
...                    ...          ...                    ...
16986                  NaN            L                    NaN
16987                  NaN            L                    NaN
16988                  NaN            S                    NaN
16989                  NaN            L                    NaN
16990                  NaN            L                    NaN

      Experience level Employment type
0                   EN             NaN
1                   SE             NaN
2                   SE             NaN
3                   MI             NaN
4                   MI             NaN
...                ...             ...
16986               SE              FT
16987               MI              FT
16988               EN              FT
16989               EN              CT
16990               SE              FT

[16991 rows x 14 columns]

In [ ]:
# prompt: create a csv file of final table

final_table.to_csv('final_table.csv', index=False)